Revit 2027 API
EnergyAnalysisSpace.GetBoundary Method
 Gets the collection of polygons that form the 2D boundary. This method returns a collection of polyloops (planar polygons) that defines an enclosed area measured by interior bounding surfaces, if in rooms and spaces mode. In other modes, returns no polyloops.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Polyloop> GetBoundary()
Public Function GetBoundary As IList(Of Polyloop)
public:
IList<Polyloop^>^ GetBoundary()
member GetBoundary : unit -> IList<Polyloop>
Return Value
IList<Polyloop>
 The collection of polygons that form the 2D boundary.
See Also
Reference
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace